# PANDAS 13 Konversi nilai numerik ke dalam sejumlah kategori

## Cek Versi

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.3
1.19.2

## Perisapan Data Frame

In [4]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0     5
1    28
2    76
3    90
4     9
5    88
6    82
7    71
8     8
9    56

## Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [5]:
df['kelompok_usia'] = pd.cut(df['usia'], #cut = potong sesuai kategori dengan batas
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0     5          anak
1    28        dewasa
2    76        manula
3    90        manula
4     9          anak
5    88        manula
6    82        manula
7    71        manula
8     8          anak
9    56        dewasa